[
  {
    "type": "talk_topic",
    "id": "HUB01_DIRECTOR_1_guards",
    "dynamic_line": {
      "u_has_mission": "INTERCOM_MEET_DIRECTOR",
      "yes": "You are escorted by a trio of masked guards as you cross through the empty hall of the bunker's administrative wing.  They maintain a respectful distance, but their hands don't leave their weapons even as they open the door to the director's office.  They signal you inside but make no move to follow you themselves."
    },
    "responses": [ { "text": "Enter the office.", "topic": "TALK_DONE", "condition": { "u_has_trait": "PROF_HUB01_ANCILLIARY" } } ]
  },
  {
    "type": "talk_topic",
    "id": "HUB01_DIRECTOR_1_intro",
    "dynamic_line": {
      "u_has_mission": "INTERCOM_MEET_DIRECTOR",
      "yes": "*You find the director intently studying a desk-embed screen, her standing figure framed by an intimidating collection of academic achievements that hangs from the far side of the room.  She doesn't address you until the door is closed behind you.  \n\n\"It all feels oddly out of place now, don't you think?  The , uniformed escort, the fancy offices.  Just setup meant to project an idea of prosperity.  We don't thrive, of course.  We merely survive, like everyone else.\" she states, expressing concern that seems too trained to be genuine.  \"What point is there to the sacrifices made today, if they serve only as a springboard for those of tomorrow?\"*",
      "no": "The guards allow you in?  What are you doing here?'"
    },
    "responses": [
      { "text": "Sacrifice is the price of progress.  We'll get t", "topic": "HUB01_DIRECTOR_1_intro_continues" },
      { "text": ", " },
      {
        "text": "Director Ma'am we all know what I'm good at.  Dispense with it and just tell me what you need shot and what you are offering.",
        "topic": "TALK_DIRECTOR_1_JOB_OFFER",
        "effect": { "npc_add_var": "player_skip_intro", "value": "yes" }
      },
      { "text": "Remain silent.", "topic": "HUB01_DIRECTOR_1_intro_continues" }
    ]
  },
  {
    "id": "HUB01_DIRECTOR_1_intro_continues",
    "type": "talk_topic",
    "dynamic_line": {
      "concatenate": [
        {
          "npc_has_var": "player_said_somenthing_intro",
          "value": "yes",
          "yes": "The director continues, unbothered by your interjection.",
          "no": "The question is allowed to hang in the air for a brief moment."
        },
        "  \"We now have an opportunity to break this cycle of misery, and it requires a role be played by someone well versed with the surface.  This I hope, will be you.\""
      ]
    },
    "responses": [
      {
        "text": "And what would be my role in this?",
        "topic": "TALK_DIRECTOR_INTERNAL_POLITICS",
        "condition": { "not": { "u_has_trait": "PROF_HUB01_ANCILLIARY" } },
        "effect": "flee"
      },
      {
        "text": "Remain silent.",
        "topic": "TALK_DONE",
        "effect": { "u_add_var": "u_met_ADzvonko", "type": "general", "context": "meeting", "value": "yes" },
        "condition": { "u_has_trait": "PROF_HUB01_ANCILLIARY" }
      }
    ]
  },
  {
    "id": "TALK_DIRECTOR_IN_FOR",
    "type": "talk_topic",
    "dynamic_line": "Direct access to our facilities.  Gear, lodging, research intel and ",
    "responses": [
      { "text": "Your work?", "topic": "TALK_DIRECTOR_HUB_ROLES" },
      { "text": "And what part do I play in this?", "topic": "TALK_DIRECTOR_INTERNAL_POLITICS" }
    ]
  },
  {
    "id": "TALK_DIRECTOR_1_JOB_OFFER",
    "type": "talk_topic",
    "dynamic_line": "You realize the desktop screen is much larger than expected when the entire desk surface lights up with an aerial photograph of a fortified compound. \"I'll keep it simple.  We need someone that can scout, clear, and hold the facility shown here until we can send a restoration team.  We don't expect the task to be particularly dangerous to someone with your skill set, but the site is of immense strategic importance, so we need someone dependable.",
    "responses": [
      { "text": "Look closer into the photograph", "topic": "TALK_DIRECTOR_HUB_MISSION_INTEL" },
      { "text": "What's the intel on the place?", "topic": "TALK_DIRECTOR_HUB_MISSION_INTEL" },
      {
        "text": "Certainly your security could handle this.  What's the catch?",
        "topic": "TALK_DIRECTOR_INTERNAL_POLITICS"
      },
      { "text": "And whats in for me.", "topic": "TALK_DIRECTOR_INTERNAL_POLITICS" }
    ]
  },
  {
    "id": "TALK_DIRECTOR_1_OWN_PEOPLE",
    "type": "talk_topic",
    "dynamic_line": "My men are well equipped, but their ability to work on the surface remains unproved, unlike yours."
  },
  {
    
  },
  {
    "id": "TALK_DIRECTOR_1_OLD_GUARD",
    "type": "talk_topic",
    "dynamic_line": "You place your faith with the 2nd fleet remnant?  Do you know that they sank most of the northwestern coast guard and then bombed Natu?  They are traitors and mutineers all, and even if they could be trusted, they are a spent force.  The country will not raise from the ashes, not matter how many flags they hoist."
  },
  {
    "id": "TALK_DIRECTOR_1_GOOD_TO_KNOW",
    "type": "talk_topic",
    "dynamic_line": "A scouting units dispatched to one of our sister research facilities.   Have detected signs of ongoing reasearch.  A",
    "responses": [
      { "text": "Take a look at the drone scout's report", "topic": "TALK_DONE" },
      { "text": "", "topic": "TALK_DIRECTOR_INTERNAL_POLITICS" }
    ]
  },
  {
    "id": "TALK_DIRECTOR_1_Survey_room",
    "type": "talk_topic",
    "dynamic_line": "The site consist of a fortified compound built around a large cubical warehouse.  An open maintenance hatch on the warehouse roof has been digitally highlighted as \"recommended access point\".  A small number of zombies are visible wandering, a few wear the remnants of military uniforms.",
    "responses": [
      { "text": "Couldn't fit the survey drone inside?", "topic": "TALK_DIRECTOR_NRE_EXPLANATION" },
      { "text": "How many zombies inside?", "topic": "TALK_DIRECTOR_1_ZOMBIE_COUNT" },
      { "text": "What's in the warehouse?", "topic": "TALK_DIRECTOR_1_INSIDE" },
      { "text": "I've seen enough.", "topic": "TALK_DIRECTOR_INTERNAL_POLITICS" }
    ]
  },
  {
    "id": "TALK_DIRECTOR_1_ZOMBIE_COUNT",
    "type": "talk_topic",
    "dynamic_line": "The site would have been operating with a skeleton crew when disaster struck.  Based on our estimates that would have been around 15 security personel and as many technicians, we don't expect any of them to have made it out or survived, as you can see from the footage\". The screen turns to show a single employee profile.  \"The site's security chief, in case you find him alive.\""
  },
  {
    "id": "TALK_DIRECTOR_1_INSIDE",
    "type": "talk_topic",
    "dynamic_line": "The screen turns to displace a CAD schematic of a complex machine, built into the shape of pillar, and supposedly situated in the central warehouse of the compound.  Segments the machine's interior are unlabeled and undrawn. \"This is a nanofabricator master unit.  One of the two original's retrieved, and from which the simpler prototype models where derived.  By all effects, its a machine that can build anything, given the right materials and a blueprint.",
    "responses": [
      { "text": "Shit how do you even build something like this?", "topic": "TALK_DIRECTOR_BUILD_NANOFAB" },
      { "text": "And it works still?", "topic": "TALK_DIRECTOR_NRE_EXPLANATION" },
      { "text": "Your restoration team really can fix it?", "topic": "TALK_DIRECTOR_INTERNAL_POLITICS" },
      { "text": "I've seen enough.", "topic": "TALK_DIRECTOR_INTERNAL_POLITICS" }
    ]
  },
  {
    "id": "TALK_DIRECTOR_1_SURVEY_DRONE",
    "type": "talk_topic",
    "dynamic_line": "Not fruitfully, the entire warehouse is EM shielded, we loose connection two feet in.  We know theres a maintenance gantry right behind it, so the immediate access to the building should be relatively safe."
  },
  {
    "id": "TALK_DIRECTOR_1_Survey_room",
    "type": "talk_topic",
    "dynamic_line": "You proceed through a limited description of a massive robotic assembler, the ",
    "responses": [
      { "text": "This doesnt really look at all diferent to any zombie infested ", "topic": "TALK_DONE" },
      { "text": "I've read enough.  Lets discuss payment.", "topic": "TALK_DIRECTOR_INTERNAL_POLITICS" }
    ]
  },
  {
    "id": "TALK_DIRECTOR_1_Survey_room",
    "type": "talk_topic",
    "dynamic_line": "The binder continues to list several delivery manifests, all for implausibly large quantities of silica sand.  An assistant has helpfully decoded what was actually delivered, mostly p",
    "responses": [
      { "text": "Power through the end of the document", "topic": "TALK_DONE" },
      { "text": "I've seen enough.  Lets discuss payment.", "topic": "TALK_DIRECTOR_INTERNAL_POLITICS" }
    ]
  },
  {
    "id": "TALK_DIRECTOR_1_FINISH_DOCUMENT",
    "type": "talk_topic",
    "dynamic_line": "This veritable bible of near useless information ends with the DARPA employment profiles of the facility senior staff.  Try as you might you cant really show much interest for these likely dead people.  The scientists expectedly display knowledge in very complex-sounding fields, and the security chief appears to have served as a green beret in Rwanda.  All in all, you should expect some 10 zombies clad in military gear and 30 technicians, that assuming no one made it out.",
    "responses": [
      {
        "text": "Respectfully ma'am director, I dont think you'll loot 'survival\" from some empty industrial ruins.  But I'll do it, payment upfront.",
        "topic": "TALK_PAYMENT"
      },
      { "text": "Looks interesting.  Someone should do something", "topic": "TALK_PAYMENT" },
      {
        "text": "Well if there's any survivors we owe it to them to at least try a rescue.",
        "topic": "TALK_ALTRUIST_PAYMENT"
      },
      { "text": "I think you have an urgent case of pay me to figure out.", "topic": "TALK_PAYMENT" },
      { "text": "All those poor scientists, someone should do somenthing.", "topic": "TALK_PAYMENT" },
      {
        "text": "Don't know, I just pretended to read that because it felt like you wanted me too.",
        "topic": "TALK_PAYMENT"
      }
    ]
  },
  {
    "id": "TALK_DIRECTOR_1_Survey_room",
    "type": "talk_topic",
    "dynamic_line": "Money alone would be a poor reward for the immense trust ",
    "responses": [
      { "text": "Its wood expensive for sure, is it FEEL nice wood too?", "topic": "TALK_DONE" },
      { "text": "And my payment?", "topic": "TALK_DIRECTOR_INTERNAL_POLITICS" }
    ]
  },
  {
    "id": "TALK_DIRECTOR_1_Survey_room",
    "type": "talk_topic",
    "dynamic_line": "Your start from the desk, the obvious centerpiece and the most conveniently placed object around.  It's a massive slab of polished hard-wood, seemingly carved from an implausibly gigantic tree.  The working surface is a single piece of black tempered glass that tastefully hides the embed-screen now that its turned off.  You'd expect to see a piece like this in the penthouse office of some tech CEO, not hidden in the basement of a research facility.  Either this Irene is a secret billionaire or you are witnessing one of the most bloated blacksite budgets in history.",
    "responses": [
      { "text": "Its look nice wood but, is it FEEL nice wood too?", "topic": "TALK_DONE" },
      { "text": "And my payment?", "topic": "TALK_DIRECTOR_INTERNAL_POLITICS" }
    ]
  },
  {
    "id": "TALK_DIRECTOR_1_Survey_diplomas",
    "type": "talk_topic",
    "dynamic_line": "To your surprise, most of the diretor achievements are completely unrelated to the fields of robotics, mathematics or computing sciences.  You see a few awards for lectures in ",
    "responses": [ { "text": "And my payment?", "topic": "TALK_DIRECTOR_INTERNAL_POLITICS" } ]
  },
  {
    "id": "TALK_DIRECTOR_1_wood_feels_nice",
    "type": "talk_topic",
    "dynamic_line": "Oh yes this IS feel nice wood, discount swedish furniture wishes it could be negatively compared to this.",
    "responses": [ { "text": "And my payment?", "topic": "TALK_DIRECTOR_INTERNAL_POLITICS" } ]
  },
  {
    "id": "TALK_DIRECTOR_1_END",
    "type": "talk_topic",
    "dynamic_line": "Done.  Direct yourself to my assistant, she'll provide you with the hardware required to access the site.\"  You feel a subtle ambience shift as the hallway guards are summoned by some invisible signal.  \"She's authorized to answer any questions you might still have\"",
    "responses": [ { "text": "Allow the guards to escort you out.", "topic": "TALK_DONE" } ]
  }
]
