[
  {
    "type": "npc",
    "id": "arsonist_bem",
    "name_unique": "Makayla Sanchez",
    "name_suffix": "Arsonist",
    "gender": "female",
    "class": "NC_MAKAYLA_FOLLOWER",
    "attitude": 0,
    "mission": 3,
    "age": 24,
    "height": 165,
    "chat": "TALK_ARSONIST_BEM",
    "//": "This version of Makayla is part of the Ancilla to simplify interactions with the player, and other npcs.",
    "faction": "robofac_auxiliaries"
  },
  {
    "type": "talk_topic",
    "id": "TALK_ARSONIST_BEM",
    "dynamic_line": {
      "math": [ "u_met_makayla == 1" ],
      "yes": " You find Makayla sitting against The Terminal's bar.  By the looks of it, she's been waiting for a while.",
      "no": {
        "math": [ "u_insulted_makayla == 1" ],
        "yes": "It looks like one of the refugee center mutants is here.",
        "no": "A knitted cap only calls attention to the scavenger's disguised ears, or lack of them.  The way she leans against the bar easily tells she's been here for a while."
      }
    },
    "responses": [
      {
        "truefalsetext": {
          "condition": { "math": [ "u_met_makayla == 1" ] },
          "true": "Hey never thought I'd find you gere",
          "false": "Waiting for something?"
        }
      },
      {
        "truefalsetext": { "condition": { "math": [ "u_insulted_makayla == 1" ] }, "true": "[Disgusting.]", "false": "See you around." },
        "topic": "TALK_DONE"
      }
    ]
  },
  {
    "type": "talk_topic",
    "id": "MAKAYLA_BEM_DOING",
    "dynamic_line": [
      {
        "concatenate": [
          {
            "math": [ "u_met_makayla == 1" ],
            "yes": "Oh hey! Yeah, I show up here every now and then.  You know, to keep up with the news, and to trade too.  Speaking of, I'm supposed to meet someone for a trade, but he's a whole day late now.  Not feeling very confident about it now",
            "no": "Yeah, waiting for another scavenger to show, but he's a whole day late now.  Not feeling very confident about it now"
          },
          {
            "u_has_faction_trust": 10,
            "yes": ".  Oh, but you are one of the regulars here, right?  Maybe you know him?  At least enough to help me find him.",
            "no": "."
          }
        ]
      }
    ],
    "responses": [
      {
        "text": "I suppose I'm feeling generous today.  Do you know the guys name?  Or at least how he looks like?",
        "condition": { "u_has_faction_trust": 10 },
        "topic": "TALK_BEM_MAKAYLA_HELP"
      },
      {
        "truefalsetext": {
          "condition": { "u_has_faction_trust": 10 },
          "true": "I don't think so, besides, he probably got eaten by something.  Good luck though.",
          "false": "Good luck then."
        },
        "topic": "TALK_DONE"
      }
    ]
  },
  {
    "id": "BEM_MAKAYLA_HELP",
    "type": "talk_topic",
    "dynamic_line": "Thomas I think.  A bit taller than me, tan, dark hair, looks like he got clawed on by a bear in the right side of his face.  Think you know him?",
    "responses": [
      {
        "text": "Oh I had a drink with him once, pretty crazy guy, does lab raids while not in contract with Hub.  I think he holes up in an unfinished station down the eastern tunnels.",
        "topic": "TALK_BEM_MAKAYLA_INVOLVE_ANDREW"
      },
      { "text": "Not really.  Andrew!  You know of this guy?", "topic": "TALK_BEM_MAKAYLA_INVOLVE_ANDREW" }
    ]
  },
  {
    "id": "TALK_BEM_MAKAYLA_INVOLVE_ANDREW",
    "type": "talk_topic",
    "dynamic_line": "Hey don't go around telling everyone about my problems!\"  she eyes you while pulling her cap even lower against her head.  She has basically melted into the bar by the time Andrew arrives.   \"Well, yes, that sounds like Thomas.  Figured he had dropped the deal for a reason, but that not really his usual MO.  I know he stages lab raids in an unfinished station down the eastern tunnels.  Go check there, maybe you'll find him.  And let me know if he's alright, got it?",
    "responses": [
      { "text": "There you go, Makayla.  Good luck.", "topic": "TALK_MAKAYLA_BEM_GO" },
      { "text": "Thanks Andrew, I'll see what I can do.", "topic": "TALK_DONE" }
    ]
  },
  {
    "type": "talk_topic",
    "id": "TALK_MAKAYLA_BEM_GO",
    "dynamic_line": "I really dont know Thomas well enough to just show up at his place unannounced.  Would you mind tagging along for this?  I'll pay for sure.",
    "responses": [ { "text": "Good luck.", "topic": "TALK_DONE" } ]
  },
  {
    "type": "talk_topic",
    "id": "MAKAYLA_BEM_DOING",
    "dynamic_line": {
      "u_has_var": "makayla_mutation_trust",
      "type": "talk",
      "context": "arsonist",
      "value": "yes",
      "yes": "Uh well\" She looks around, worried about the prospect of being overheard.  \"He's got some sort of medicine for my thing.\"  She rapidly gestures towards her knit cap.  \"Sure, I look normal-ish now, but it gets worse whenever the sky goes bad.  It gets really bad, to",
      "no": "Its really important to me alright.  I thought the Hub put up with your group because you were discreet."
    },
    "responses": [
      { "text": "Oh so its like some weird werewolf thing?", "topic": "TALK_MAKAYLA_BEM_MUTATION" },
      { "text": "Alright, lets get your whatever it is.", "topic": "TALK_DONE" },
      { "text": "Good talk.", "topic": "TALK_DONE" }
    ]
  },
  {
    "type": "talk_topic",
    "id": "TALK_MAKAYLA_BEM_MUTATION",
    "dynamic_line": "Yes.  Please forget I said anything\"  She sighs.  \"So l",
    "responses": [ { "text": "Lets get going.", "topic": "TALK_DONE" } ]
  }
]
